[Cues]
Act_E2_1A_Bathroom_CHKate_Look01_Max_010="Kate is not good. I wish David would "get off her crack," as Chloe would say."
Act_E2_1A_Bathroom_CHKate_Look02_Max_020="After my shower, I'll bring her book back and that'll be a good excuse for us to chat. Maybe just talking with a friend will help her feel better..."
Act_E2_1A_Bathroom_Faucet_Look01_Max_010="Water is almost as good as a cup of strong tea when I'm in sleepy-mode."
Act_E2_1A_Bathroom_Faucet_Look02_Max_020="Oops. I forgot about the water pressure."
Act_E2_1A_Bathroom_Faucet_Look03_Max_030="Now you can enjoy your showers in peace. You're welcome."
Act_E2_1A_Bathroom_KateVideoLink_Interact01_Max_020="Even if I can stop one person from watching it, it's worth it."
Act_E2_1A_Bathroom_KateVideoLink_Look01_Max_010="Is that the link to Kate's video? Damn, Victoria is so fucking mean."
Act_E2_1A_Bathroom_Poster01_Look01_Max_010=""Otter Power"? I'm so not there."
Act_E2_1A_Bathroom_Poster02_Look01_Max_010="The last time I got a flu shot, I got the flu. Fuck you."
Act_E2_1A_Bathroom_TamponDispenser_Look01_Max_010="I'm good to flow, thanks."
Act_E2_1A_Corridor_BlackwellMap_Look01_Max_010="Blackwell isn't that big, but it sure feels like a labyrinth."
Act_E2_1A_Corridor_CHAlyssa_Look01_Max_010="Alyssa is such an easy target for those jerks. I should help her..."
Act_E2_1A_Corridor_CHAlyssa_Look02_Max_020="If I help Alyssa, I could be like the "godmother of Blackwell"..."
Act_E2_1A_Corridor_CHBrooke_Look01_Max_010="There's Brooke, looking smarter than everybody."
Act_E2_1A_Corridor_CHBrooke_Look02_Max_020="At least she's dedicated to her schoolwork..."
Act_E2_1A_Corridor_CHJuliet_Look01_Max_010="Whatever they're watching must be hot stuff..."
Act_E2_1A_Corridor_CHJuliet_Look02_Max_020="Juliet has no clue how much this is hurting Kate."
Act_E2_1A_Corridor_Doors_VoiceOver01_Max_010="Clearly not a morning person."
Act_E2_1A_Corridor_Doors_VoiceOver02_Max_020="Wake up, Max. Juliet is next to me in the hall... not her room."
Act_E2_1A_Corridor_Doors_VoiceOver03_Max_030="Taylor is no doubt being led around by Victoria, as usual."
Act_E2_1A_Corridor_Doors_VoiceOver04_Max_040="No Brooke here..."
Act_E2_1A_Corridor_DormMap_Look01_Max_010="Welcome to BlackHell..."
Act_E2_1A_Corridor_ExpressionPanel02_Look01_Max_010="Man, people here are merciless."
Act_E2_1A_Corridor_ExpressionPanel02_Look01_Max_020="Could be fun. Glad I'm not the only lonely nerd around here."
Act_E2_1A_Corridor_ExpressionPanel02_Look01_Max_030="Thanks for the warning."
Act_E2_1A_Corridor_ExpressionPanel_Look01_Max_010="This is like the public DNA of our dorm..."
Act_E2_1A_Corridor_ExpressionPanel_Look01_Max_020="Go, Ms. Grant! Not sure if I will though... I'm a loser."
Act_E2_1A_Corridor_KateDoor_VoiceOver01_Max_010="Kate is an early bird. She might be up and gone..."
Act_E2_1A_Corridor_KateSlate_Look01_Max_010="The marks of Satan."
Act_E2_1A_Corridor_KateSlate_Look02_Max_020="I sure would like to catch this hall tagger..."
Act_E2_1A_Corridor_MPA01_VoiceOver01_Max_010="Rachel looks like she's staring at me..."
Act_E2_1A_Corridor_MPA01_VoiceOver03_Max_030="I would love to believe Rachel Amber is just hiding."
Act_E2_1A_Corridor_MPA01_VoiceOver04_Max_040="Chloe is so determined to find you, Rachel."
Act_E2_1A_Corridor_MaxSlate_Look01_Max_010="Why would anybody even care? I thought artists helped each other..."
Act_E2_1A_Corridor_MaxSlate_Look02_Max_020="Two can play at this game, Moriarty. They might not believe it—but they won't be sure."
Act_E2_1A_Corridor_Poster01_Look01_Max_010="I think I'll be way too scared to go."
Act_E2_1A_Corridor_Poster02_Look01_Max_010="Nice atmospheric shot. Needs dusting."
Act_E2_1A_Corridor_Poster03_Look01_Max_010=""They live!""
Act_E2_1A_Corridor_Poster04_Look01_Max_010="But what's this poster really trying to tell me?"
Act_E2_1A_Corridor_ScoreBoard_Look01_Max_010="I'd love to make a photo collage of every person who've posted these."
Act_E2_1A_Corridor_ToiletPaper_Look01_Max_010="One quick rewind and I could stop this TP attack..."
Act_E2_1A_Corridor_TrashCan_Look01_Max_010="Samuel truly is a weirdo... but he is great at cleaning up."
Act_E2_1A_Corridor_VictoriaDoor_VoiceOver01_Max_010="Fine, I won't disturb you."
Act_E2_1A_DanaRoom_BigfootBanner_Look01_Max_010="Dana takes her Blackwell spirit seriously."
Act_E2_1A_DanaRoom_BirthControl_Look01_Max_010="Hmmmm..."
Act_E2_1A_DanaRoom_CHDana_Look01_Max_010="I've never seen Dana this bouncy and happy without a pot of coffee."
Act_E2_1A_DanaRoom_CheerleaderOutfit_Look01_Max_010="I can't even imagine what life would be like being a cheerleader. Dramatic, I guess."
Act_E2_1A_DanaRoom_DanaLaptop_Look01_Max_010="Curiosity killed the Max..."
Act_E2_1A_DanaRoom_DanaLaptop_Look02_Max_020="Who will survive and what will be left of them? Don't say that out loud, dork."
Act_E2_1A_DanaRoom_DanaLaptop_Look03_Max_030="That would be fun to put skulls and ghosts all over Blackwell..."
Act_E2_1A_DanaRoom_DanaLaptop_Look04_Max_040="Like I could pull this look off... Hello, Victoria!"
Act_E2_1A_DanaRoom_HalloweenStuff_Look01_Max_010="That is so damn cute how much Dana is into this Halloween party."
Act_E2_1A_DanaRoom_LoganNote_Look01_Max_010="This is both sad and pathetic."
Act_E2_1A_DanaRoom_MakeUp_Look01_Max_010="Speaking of Halloween, look at all this makeup. At least Dana knows how to use it."
Act_E2_1A_DanaRoom_Rollers_Look01_Max_010="Rollerblades! I wanted to be a derby girl, but I almost broke my feet just putting them on..."
Act_E2_1A_DanaRoom_TrevorJacket_Look01_Max_010="Trevor is making himself comfortable. Hope they don't get busted."
Act_E2_1A_Dormitory_BookKate_VoiceOver01_Max_010="Kate needs her book back and I better not screw her over, like she thinks I did yesterday..."
Act_E2_1A_Dormitory_BookKate_VoiceOver02_Max_020="Kate needs her book back and since I'm going to be her new ally, I better get on the ball."
Act_E2_1A_Dormitory_ChloeSMS_VoiceOver01_Max_010="Even with all this crazy shit going on, it is so cool having Chloe back in my life again. Like no time has passed..."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver01_Max_010="Okay, time to get dressed for the day."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver02_Max_020="I better get dressed, then go give back Kate's book."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver03_Max_030="I need to get dressed before I go there."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver04_Max_040="Oh shit, Nathan's revenge. Even Chloe told me not to go to the Principal..."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver05_Max_050="Victoria. Of course. That's what I get for making fun of her... Bitch."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver07_Max_070="Come on, Max. Think where you last put down the book..."
Act_E2_1A_Dormitory_MaxRoom_VoiceOver08_Max_070="Oh shit, now I'm getting anonymous threats? It never ends... This has to be from Nathan... but it could be anybody... I better be doubly careful around here or I could be in serious danger... If I'm not already."
Act_E2_1A_Dormitory_Shower_VoiceOver01_Max_010="Being a superhero is dirty work. I need a shower."
Act_E2_1A_Dormitory_Shower_VoiceOver02_Max_020="No amount of rewind will keep me clean. I still need a shower."
Act_E2_1A_Dormitory_Shower_VoiceOver03_Max_030="I better not leave without my shower supplies."
Act_E2_1A_KateRoom_AbstinenceFlyer_Look01_Max_010="Maybe Kate has a split personality... Church girl by day, party monster by night?"
Act_E2_1A_KateRoom_AuntLetter_Look01_Max_010="Ouch. She left out "damnation.""
Act_E2_1A_KateRoom_Bible_Look01_Max_010="Kate even makes notes in her bible... My parents never once took me to church. I had nothing to rebel against. I don't know what to believe now..."
Act_E2_1A_KateRoom_CHKate_Look01_Max_010="Poor Kate, she doesn't look good..."
Act_E2_1A_KateRoom_CHKate_Look02_Max_020="Jesus, this is intense. If Kate wasn't out of it and is actually telling the truth..."
Act_E2_1A_KateRoom_ChildrenDrawings_Look01_Max_010="Kate's art is perfect for a children's book—everything looks so fun and colorful and... positive."
Act_E2_1A_KateRoom_CreepyDrawings_Look01_Max_010="Good Lord. This must be Kate's "H. R. Giger" period..."
Act_E2_1A_KateRoom_FamilyPortrait_Look01_Max_010="Damn, it's the All-American Zombie Family."
Act_E2_1A_KateRoom_FatherPostCard_Look01_Max_010="Kate really has a doting father."
Act_E2_1A_KateRoom_GroupPhoto_Look01_Max_010="I had no idea that Kate ever hung out with Alyssa and Stella..."
Act_E2_1A_KateRoom_KateBook_VoiceOver03_Max_030="Time out, Max. You actually told Kate to go to the police and the Principal... after getting a scary text threat. Now the police will definitely drag you into this shit."
Act_E2_1A_KateRoom_KateBook_VoiceOver04_Max_040="Good job, Dr. Max. She didn't like what I had to say, but we need more proof of what happened."
Act_E2_1A_KateRoom_KateTablet_Look01_Max_010="Kate is all alone dealing with this video bullshit. I hope her mother doesn't disown her..."
Act_E2_1A_KateRoom_MessyClothes_Look01_Max_010="Kate's room is usually immaculate. For her this must be a pigsty..."
Act_E2_1A_KateRoom_Mirror_Look01_Max_010="Why did she cover up the mirror? She can't look at herself?"
Act_E2_1A_KateRoom_Pictures_Look01_Max_010="Hey, I'm trying to use my powers for good."
Act_E2_1A_KateRoom_Rabbit_Look01_Max_010="That is the cutest bunny ever. I bet Kate is a good mommy."
Act_E2_1A_KateRoom_SistersPhoto_Look01_Max_010="Almost forgot what Kate looks like when she smiles..."
Act_E2_1A_KateRoom_Tissues_Look01_Max_010="That's a lot of tears. She's going to go through boxes."
Act_E2_1A_KateRoom_Violin_Look01_Max_010="Kate used to play the violin every morning... She stopped last week..."
Act_E2_1A_KateRoom_Windows_Look01_Max_010="It's way too emo in here. Kate isn't that gloomy... until lately."
Act_E2_1A_MaxRoom_Artbooks_Look01_Max_010="Cartier-Bresson, Doisneau, Hamilton... The greatest!"
Act_E2_1A_MaxRoom_BookRoomClean_Look01_Max_010="This is such a wise, wistful book. I have to read way more Bradbury..."
Act_E2_1A_MaxRoom_BookRoomSacked_Interact01_Max_020="Now I can finally take this back to Kate before I'm late. As if I have to worry about being late anymore... I do have all the time in the world now."
Act_E2_1A_MaxRoom_BookRoomSacked_Look01_Max_010="Aha, you sneaky book, you're mine!"
Act_E2_1A_MaxRoom_Desk_Interact01_Max_010="My desk is a pigsty, but... I know it ain't there."
Act_E2_1A_MaxRoom_FacebookMeme_Look01_Max_010="Thanks Victoria. I always wanted to be a "Max meme" when I grew up. She'll spread that shit everywhere."
Act_E2_1A_MaxRoom_Katebook_Interact03_Max_010="Better fix this fast. Kate needs the book and I don't want to add to her list of problems."
Act_E2_1A_MaxRoom_Katebook_Interact04_Max_010="Begone, foul soft drink!"
Act_E2_1A_MaxRoom_MaxBed_Interact01_Max_020="I am so not a rebel. I always like my bed to be neat and tidy. Thanks, Mom."
Act_E2_1A_MaxRoom_MaxBed_Look01_Max_010="This totally reminds me of being a kid in my room. Sorry Mom, I can make my bed whenever I want. Boo yah!"
Act_E2_1A_MaxRoom_MaxBooks_Look01_Max_010="I could rewind for days and read all of these books. Will I really find any insight into my power?"
Act_E2_1A_MaxRoom_MaxCamera_Interact01_Max_020="No smiling. Take your power seriously."
Act_E2_1A_MaxRoom_MaxCamera_Look01_Max_010="This picture will capture this crazy historic moment in my life..."
Act_E2_1A_MaxRoom_MaxClothes_Interact01_Max_020="Maybe I'll just put on a shirt and jeans. Hey, Einstein had the same exact suit for every day of the week. And he couldn't even rewind time."
Act_E2_1A_MaxRoom_MaxClothes_Look01_Max_010=""Good morning, clothes! I hope you slept well... Now, shall it be my Gucci shirt with the Vuitton jacket?""
Act_E2_1A_MaxRoom_MaxClothes_Look02_Max_010=""I'll wear those cute cute lace boots so I can cruise the Blackwell halls in style... Oh Victoria, you're such a fashion boss!""
Act_E2_1A_MaxRoom_MaxDVDS_Look01_Max_010="Now I have to wonder if any of these films are based on a true story..."
Act_E2_1A_MaxRoom_MaxDoor_Voiceover_Max_010="Hold up, I need to find the book before going to see Kate."
Act_E2_1A_MaxRoom_MaxGuitar_Look01_Max_010="Meanwhile, my guitar gently sleeps."
Act_E2_1A_MaxRoom_MaxLaptop_Interact01_Max_020="This is so insane it sounds logical to me..."
Act_E2_1A_MaxRoom_MaxLaptop_Interact02_Max_030="This wormhole thing makes total sense, but doesn't explain how I can do what no scientist ever has..."
Act_E2_1A_MaxRoom_MaxLaptop_Interact03_Max_040="I would say this is some crazy shit, but now I'm not so certain... Should I sign?"
Act_E2_1A_MaxRoom_MaxLaptop_Interact04_Max_050="Warren is blowing up my inbox now. As long as he helps me figure this out."
Act_E2_1A_MaxRoom_MaxLaptop_Interact05_Max_060="And I thought I was into Halloween. Dana is not messing around here."
Act_E2_1A_MaxRoom_MaxLaptop_Look01_Max_010="Whew, I could get lost doing time travel research. Me and the search engine have become one. If only I could be this focused on homework."
Act_E2_1A_MaxRoom_MaxNotes_Look01_Max_010="I can't keep my eyes open, but I know there's a scientific answer..."
Act_E2_1A_MaxRoom_MaxObject01_Interact01_Max_010="Uh oh! I wonder if I'll ever wear a watch again..."
Act_E2_1A_MaxRoom_MaxObject02_Interact01_Max_020="It would be fun to get some peeps together and play a real game instead of drama games..."
Act_E2_1A_MaxRoom_MaxPlant_Interact01_Max_020="Drink up... It's got electrolytes."
Act_E2_1A_MaxRoom_MaxPlant_Interact02_Max_040="Drink up... I can bring you back... I hold the power over life itself..."
Act_E2_1A_MaxRoom_MaxPlant_Look01_Max_010="Good morning, Lisa. Your leaves are lovely today. I may not have a green thumb, but I have a green finger..."
Act_E2_1A_MaxRoom_MaxPlant_Look02_Max_030="Oh Lisa, I've left you on the brink of drought!"
Act_E2_1A_MaxRoom_MaxSchedule_Look01_Max_010="Mrs. Hoida is still out sick. I heard somebody say she has severe depression. Poor thing."
Act_E2_1A_MaxRoom_Mirror_Interact01_Max_020="Whoa, hello zombie-face. This is what happens when you research quantum physics all night..."
Act_E2_1A_MaxRoom_PhotoPanel_Look01_Max_010="That's the only tourist picture I let them take of me at the Space Needle..."
Act_E2_1A_MaxRoom_PhotoPanel_Look01_Max_020="That was a good hockey game, and a great fight."
Act_E2_1A_MaxRoom_PhotoPanel_Look01_Max_040="Man, Kristen and Fernando were so drunk hanging on the Fremont Troll..."
Act_E2_1A_MaxRoom_PhotoWall_Look01_Max_010=""The Max Caulfield Photo Memorial Wall.""
Act_E2_1A_MaxRoom_PostCard01_Look01_Max_010="Hard to believe I'm 18 now. I'm lucky my parents enabled my photo habit into adulthood."
Act_E2_1A_MaxRoom_Poster08_Look01_Max_010="Would Man Ray call them "selfie portraits"?"
Act_E2_1A_MaxRoom_RoomSacked_Interact01_Max_020="Ta da! I do love a clean room. Very zen. Except for that bullshit graffiti."
Act_E2_1A_MaxRoom_RoomSacked_Look01_Max_010="My poor Donnie Darko... How could anybody want to break cute li'l Jake Gyllenhaal?"
Act_E2_1A_MaxRoom_RoomSackedbyNathan_Look01_Max_010="Man, this could almost be art—if it wasn't so fucking sick and disturbed."
Act_E2_1A_MaxRoom_Scarf_Look01_Max_010="I'll miss going to the games with my dad. Go Thunderbirds!"
Act_E2_1A_MaxRoom_Search_Interact01_Max_010="No book here..."
Act_E2_1A_MaxRoom_Search_Interact04_Max_010="And nothing here."
Act_E2_1A_MaxRoom_Search_Interact05_Max_010="I promise to clean this up, if I find the book."
Act_E2_1A_MaxRoom_Search_Interact06_Max_010="Of course you just spilled soda on Kate's book."
Act_E2_1A_MaxRoom_ShowelGel_Interact01_Max_020="Okay Max, let's hit the showers now!"
Act_E2_1A_MaxRoom_ShowelGel_Look01_Max_010="Just because some ass pranked a girl's shampoo bottle and her hair fell out, we have to safeguard our toiletries. So summer camp."
Act_E2_1A_MaxRoom_VictoriaPhoto_Look01_Max_010="I admit, this is hilarious, but... I shouldn't sink to Victoria's bully level."
Act_E2_1A_MaxRoom_VoiceOverReveal_Max_010="I am so wrecked after staying up all night... I could use my rewind to catch a few more z's, but maybe I better save my strength..."
Act_E2_1A_MaxRoom_VoiceOver_Max_010="Max, use your brain power now. Think!"
Act_E2_1A_MaxRoom_VoiceOver_Max_020="Don't hide from me, Mr. Bradbury... I love you."
Act_E2_1A_MaxRoom_VoiceOver_Max_030="If only I had power to rewind my memory..."
Act_E2_1A_MaxRoom_VoiceOver_Max_040="Okay, where did I put the book? Where?!"
Cue_E2_1A_Bathroom_DialKate_Kate_010="Hey Max!"
Cue_E2_1A_Bathroom_DialKate_Kate_040="I'm here. Thanks again for standing up for me yesterday. I needed that."
Cue_E2_1A_Bathroom_DialKate_Kate_060="Doesn't everybody here?"
Cue_E2_1A_Bathroom_DialKate_Kate_070="Max!"
Cue_E2_1A_Bathroom_DialKate_Kate_100="Yeah, I'm sorry you didn't do anything to help. But you're just like everybody else here..."
Cue_E2_1A_Bathroom_DialKate_Kate_120="Whatever, it's done..."
Cue_E2_1A_Bathroom_DialKate_Kate_130="By the way Max, do you still have my copy of "The October Country"?"
Cue_E2_1A_Bathroom_DialKate_Kate_150="Can you please bring it back to my room this morning? I just need to take some notes for class."
Cue_E2_1A_Bathroom_DialKate_Max_020="Hey Kate."
Cue_E2_1A_Bathroom_DialKate_Max_030="How are you doing?"
Cue_E2_1A_Bathroom_DialKate_Max_050="Anytime. That guy has issues."
Cue_E2_1A_Bathroom_DialKate_Max_080="Oh! Uh... Hey, Kate."
Cue_E2_1A_Bathroom_DialKate_Max_090="Sorry about yesterday."
Cue_E2_1A_Bathroom_DialKate_Max_110="That's not true, I wanted to help, but, but—"
Cue_E2_1A_Bathroom_DialKate_Max_140="Oh. Yes, of course. It's great so far. I didn't realize Bradbury was such a poet."
Cue_E2_1A_Bathroom_DialKate_Max_160="Absolutely. I'll bring it by later."
Cue_E2_1A_Bathroom_FaucetWater_Girl_010="Hello?! Water!"
Cue_E2_1A_Bathroom_FaucetWater_Max_020="Sorry, I forgot!"
Cue_E2_1A_Bathroom_TakeShower_Kate_020="School."
Cue_E2_1A_Bathroom_TakeShower_Kate_050="Victoria, that wasn't me..."
Cue_E2_1A_Bathroom_TakeShower_Kate_080="You're going to be sorry someday."
Cue_E2_1A_Bathroom_TakeShower_Taylor_030="That's it?"
Cue_E2_1A_Bathroom_TakeShower_Taylor_060="Oh my God. Right."
Cue_E2_1A_Bathroom_TakeShower_Taylor_100="Looks like it."
Cue_E2_1A_Bathroom_TakeShower_Taylor_120="Preach it, sista."
Cue_E2_1A_Bathroom_TakeShower_Taylor_140="That was so uncool."
Cue_E2_1A_Bathroom_TakeShower_Taylor_160="She's a weirdo with that dumb camera."
Cue_E2_1A_Bathroom_TakeShower_Taylor_180="You are such an evil beeatch. I love it!"
Cue_E2_1A_Bathroom_TakeShower_Taylor_200="We ran all the way—"
Cue_E2_1A_Bathroom_TakeShower_Victoria_010="What's up, Kate?"
Cue_E2_1A_Bathroom_TakeShower_Victoria_040="That video of you clubbing didn't look like homework..."
Cue_E2_1A_Bathroom_TakeShower_Victoria_070="Don't be shy. I think it's awesome you set a tongue record on video..."
Cue_E2_1A_Bathroom_TakeShower_Victoria_090="Oh boo hoo, I'm sorry you're a viral slut. I'm sure she had fun."
Cue_E2_1A_Bathroom_TakeShower_Victoria_110="I know Nathan hooked her up. And you know he has the good shit."
Cue_E2_1A_Bathroom_TakeShower_Victoria_130="Yuck. I still have goddamn paint all over my face. "Max Selfie" thought she was a badass taking that picture. I shoulda beat her down."
Cue_E2_1A_Bathroom_TakeShower_Victoria_150="She's jealous because Mark—Mr Jefferson knows I'm going to win the "Everyday Heroes" contest. He thinks Max is a joke."
Cue_E2_1A_Bathroom_TakeShower_Victoria_170="I hate that "I'm so quirky" crap. Anyway. Let's leave the link to Kate's video so everybody gets a chance to see her in action..."
Cue_E2_1A_Bathroom_TakeShower_Victoria_190="Yuck. I still have goddamn paint all over my face. Good thing my faithful minions took their sweet time bringing me a towel..."
Cue_E2_1A_Bathroom_TakeShower_Victoria_210="Give it a rest, Taylor. Now I know if I'm in an accident I won't rely on you or Courtney for help. You can hang out with Kate... or Max."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_001="Okay, Max, that's twice you've saved me from a projectile weapon. Are you my guardian angel?"
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_004="Damn, that was quick thinking, Max."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_007="Blackwell has a surplus of assholes."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_009="You and Warren do know your sci-fi. Be careful, you might make Brooke jealous..."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_010="Oh, by the way, Warren said you borrowed his epic film flash drive. I didn't know you were a sci-fi geek like us. What's your favorite?"
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_011="Can you imagine going back in time to Blackwell in the 1980s?"
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Alyssa_013="I barely want to go forward in time, much less go backward."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_003="Why, hello again, Alyssa."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_005="Hardly, I just have a sixth sense for trouble. I'm glad to help you out."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_006="I'm glad my psychic skills saved you from that toilet paper beatdown."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_014="I love "Back to the Future," of course. But who doesn't?"
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_015="I love the idea of going back in time to fix mistakes in "Groundhog Day.""
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_016=""Looper" was very cool. Seriously plays with your mind. I'm still trying to figure it out..."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_018="We'd suffocate from all the hair spray."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_020="I hear you. But it's all about the choices you make now."
Cue_E2_1A_Corridor_CHAlyssa_Phase01_Max_021="I'll just pretend I have no idea what you mean."
Cue_E2_1A_Corridor_CHAlyssa_Phase02_Alyssa_002="Immature assholes... Sorry Max, I'm not feeling social right now."
Cue_E2_1A_Corridor_CHAlyssa_Phase02_Max_001="You okay, Alyssa?"
Cue_E2_1A_Corridor_CHAlyssa_Quick01_Alyssa_001="Max, let's talk later—good luck with Warren!"
Cue_E2_1A_Corridor_CHAlyssa_Quick01_Alyssa_002="Max, I don't want to talk, comprendo?"
Cue_E2_1A_Corridor_CHBrooke_Phase02_Brooke_002="Oh, hi Max."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Brooke_008="I was riveted by that weird snow flurry yesterday."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Brooke_009="I'm serious. Even meteorologists can't explain that snow. I bet Warren can. Did you talk to him yet?"
Cue_E2_1A_Corridor_CHBrooke_Phase02_Brooke_015="True. And Warren really loves to talk meteorology with me, since I'm one of the few who can talk back. Talk to you later, Max."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Brooke_016="Lucky you. I'm sure he'll track you down, Max. I'll see you around."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_001="Hey Brooke."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_003="Did you see the freak snowfall yesterday?"
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_004="You look distracted. Everything cool?"
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_005="I can't tell if you're being serious or not... Um, since I'm a science noob, I was wondering if you could explain it..."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_013="No, not at all. He's my friend, not my mother."
Cue_E2_1A_Corridor_CHBrooke_Phase02_Max_014="I will later."
Cue_E2_1A_Corridor_CHBrooke_Quick02_Brooke_001="I don't have time, Max. I can't talk now."
Cue_E2_1A_Corridor_CHBrooke_Quick02_Brooke_002="Really, Max?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_001="Hey Max, did you check out Kate's hot video yet?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_004="I didn't get wasted on camera and get busy with the Vortex Club."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_005="Because it's fucking hilarious. "Church Girl Gone Wild.""
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_007="Really? Check her out and tell me what she's like."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_009="Touche. Now I feel like an ass. Thanks for finding out the truth yesterday."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_013="Nothing... yet. My mind works in devious ways too."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_014="When he acts like a worm, I let him dangle."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_015="Not at you. Part of me was almost disappointed, because I built up so much rage."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_017="You have a good heart, Max... And I won't watch Kate's video anymore. Or pass it on."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Juliet_019="Sure, talk to you later."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_002="That's so not cool."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_003="Why should I?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_006="Kate's not like that and you know it."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_008="Do you believe everything you see? Like Zachary sexting Dana?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_010="What did you do about Victoria pulling that crap?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_011="Are you sure? I thought you'd be pissed..."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_012="What about Zachary? Did you let him off the hook?"
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_016="Glad to see you're back in action."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_018="That's the spirit! Thanks Juliet."
Cue_E2_1A_Corridor_CHJuliet_Phase01_Max_020="Hello Juliet."
Cue_E2_1A_Corridor_CHJuliet_Quick01_Juliet_001="I'm not watching the video, Max."
Cue_E2_1A_Corridor_CHJuliet_Quick01_Juliet_002="Excuse me, I'm texting Zach."
Cue_E2_1A_Corridor_CourtneyHomework_Courtney_020="Yeah, of course, Victoria. I'll get the tests and papers to you this afternoon. I am so on it. Consider it done."
Cue_E2_1A_Corridor_CourtneyHomework_Victoria_010="Courtney, seriously, do not forget I need those papers before tonight. Like, now. Thanks, cherie."
Cue_E2_1A_Corridor_KateVideo_Brooke_020="I didn't think Kate was like this... Macking on those bros? Ew."
Cue_E2_1A_Corridor_KateVideo_Brooke_040="Everybody's seen it by now..."
Cue_E2_1A_Corridor_KateVideo_Juliet_010="Gross. The Vortex Club are such pigs. I'm glad I pissed them off."
Cue_E2_1A_Corridor_KateVideo_Juliet_030="We shouldn't be watching this..."
Cue_E2_1A_Corridor_Knock02_Kate_020="Yes, I'm here. Come in, Max..."
Cue_E2_1A_Corridor_Knock02_Max_010="Kate? You in there?"
Cue_E2_1A_Corridor_Warn_Alyssa_Alyssa_020="Uh, okay, Max. If that makes you happy..."
Cue_E2_1A_Corridor_Warn_Alyssa_Alyssa_030="Wow, now that was close. Thank you, Max."
Cue_E2_1A_Corridor_Warn_Alyssa_Max_010="Alyssa, can you stand over there?"
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_002="No Max, I don't hate you. Not that I don't like juicy gossip... I just wish you weren't so nosey."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_005="Or a gift. You're very good at being nosey."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_009="At least we're showing our faces together in public... So you absolutely should go with us. Borrow one of my outfits and come as a cute geek couple with your bitch Warren..."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_021="By the way, the best and biggest news of the day is that Trevor asked me to the Halloween shindig."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_036="Much better than yesterday. I'm glad we talked."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_037="Oh yeah. Thanks again for releasing me from her captivity."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_041="You're almost psychic. I felt like you knew everything anyway..."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_042="I would laugh, but you did save me yesterday. So let's call it even."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_052="Don't let life pass you by, Max. So, are you coming to the party, or not?"
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_056="That's the spirit, Max! After this you'll be ready for a rave..."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Dana_057="You came to Blackwell to discover yourself, not hide in your dorm."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_001="Uh, hi, Dana. Do you hate me?"
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_003="It's like my fatal character flaw."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_007="Are you? I'm not trying to get into your business..."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_022="That's awesome, Dana."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_034="Hi Dana, how are you?"
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_035="What's happening, Dana? Everything cool between you and Juliet?"
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_038="Because I care."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_039="Me too. I know it's good just to talk about... this stuff."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_044="Err, I'm not big on cosplay."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_049="I won't discover myself avoiding projectile vomit from bro-dudes. Thanks anyway."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_053="Why the fuck not? If I hate it, I can always go back... to my room."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_054="No, sorry. It's just... not my thing."
Cue_E2_1A_DanaRoom_CHDana_Phase01_Max_055="It does sound like fun. Now I have to go contemplate my party future..."
Cue_E2_1A_DanaRoom_CHDana_Quick01_Dana_001="Let's talk later, Max."
Cue_E2_1A_KateRoom_Believe_Kate_020="Bless you Max. I will go to the police... and also Principal Wells. With you as my back-up witness, they'll have to take us seriously now."
Cue_E2_1A_KateRoom_Believe_Kate_040="Why? Careful of what?"
Cue_E2_1A_KateRoom_Believe_Max_010="Yes, you should definitely go to the police, Kate. I totally believe every word you say. Nathan Prescott is truly dangerous."
Cue_E2_1A_KateRoom_Believe_Max_030="Back-up witness? Well, I mean, I believe you and everything, but... we're still just spoiled punk students to the cops and faculty... I just think we need to be very careful here..."
Cue_E2_1A_KateRoom_Believe_Max_050="Nothing... except the Prescotts are a powerful family. I hope this won't backfire on us, that's all. Even though that rich bastard has earned some serious bad karma. He'll get it..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_001="Max, why did you step in between David and me yesterday?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_002="Max, why didn't you do anything when David harassed me yesterday?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_008="I was hoping he would. But it's nice to see that you care about me..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_009="I don't expect you to get in trouble for me. I just feel like nobody cares..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_010="I thought he was different. I'm happy to see that somebody cares..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_011="You had the choice to not get involved. Nobody here seems to care about anybody..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_013="Well..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_014="He's a total paranoid ass! He thinks I'm part of the Vortex Club. Yeah, right."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_018="I can't even watch it, Max..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_019="I went to a Vortex Club party against my better judgment. Not my scene at all."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_020="Because he saw the video."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_023="Thank you, Max."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_024="Are you kidding?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_025="Do you know how humiliating this is for me?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_033="Basically, I went to one Vortex Club party and ended up|making out with a bunch of people... and I have no memory of it..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_037="Lapse of sanity? I just thought I could meet some new people."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_038="I didn't."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_039="It's a long story. I'm still trying to sort it all out..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_041="I swear to God I had one sip of red wine. And then I drank water."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_044="I don't get wasted. Ever."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_045="I take a sip at church and I don't end up on a viral video, okay?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_048="I remember... I remember getting sick and dizzy..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_049="Then Nathan Prescott said he would take me to the hospital..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_054="He was being nice for a change when he offered to help me."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_055="Definitely not. I'm not sure where I went..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_056="Sick enough to need a doctor. I thought I was dying, Max."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_061="All I recall is driving for a long time... then I woke up in a room... I thought it was a hospital because it was so white and bright..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_065="That's all I remember! I don't know what happened... I woke up outside my dorm room the next day. I didn't have any marks or bruises, but I felt gross."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_066="Of course—you think I'm making this crap up? Why?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_069="I have no idea. Probably Victoria. She was there being her mean self."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_071="How do I get a viral video taken down? I know it's already spreading—what if my church sees that? I need to know what to do..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Kate_077="Somebody was talking to me in a soft voice... I thought it was a doctor... until I heard Nathan and felt a sharp sting in my neck... and... and..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_003="Go on, I'm listening."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_004="I hate bullies. David Madsen should know better."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_005="I'm sorry. I was scared. I can be pretty gutless."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_006="I wanted proof David was in your face."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_007="I had no choice. David Madsen is an asshole."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_012="Kate, I actually do care. So, what's the story with you and David?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_015="What about this video? And I swear I haven't watched it."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_016="Did you party with them?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_017="Why does he think that?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_021="I won't either."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_022="Should I watch it? Just for... posterity?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_026="I know this sucks, Kate, but... tell me about the video and maybe I can help."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_034="So, why would you go?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_035="Doesn't sound like you. I can't see you partying with Victoria..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_036="That's awful. So, how did that happen?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_040="You have to tell me more than that. What happened at the party? Did you drink?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_042="Not enough to get wasted, is it?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_043="Are you sure it was just one sip?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_046="Did somebody drug you?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_047="Go on..."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_050="Nathan Prescott? Oh shit!"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_052="How sick were you?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_053="Did you go?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_058="He's the opposite of nice. What next?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_059="So, Nathan didn't take you to the ER?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_060="What do you remember about that?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_063="And?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_067="No, I'm just... being deductive. As usual. Then what happened?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_068="So, who took the video of you at the party?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_070="Jesus Kate, I'm sorry. This is serious shit."
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_072="Kate, we'll figure it out. I'll check back later, okay?"
Cue_E2_1A_KateRoom_CHKate_Phase01_Max_076="Are you sure?"
Cue_E2_1A_KateRoom_DialKate_Kate_020="Thanks, Max... You can put my book here, near my bag."
Cue_E2_1A_KateRoom_DialKate_Max_010="Uh, hey, Kate, I brought your book..."
Cue_E2_1A_KateRoom_DontBelieve_Kate_Kate_020="But I know I was drugged—"
Cue_E2_1A_KateRoom_DontBelieve_Kate_Kate_040="You make me feel so hopeless—"
Cue_E2_1A_KateRoom_DontBelieve_Kate_Kate_060="That seems impossible at this point. So that's your answer?"
Cue_E2_1A_KateRoom_DontBelieve_Kate_Kate_080="But not right now. So I can walk down the halls with people calling me a viral slut. Thanks, Max."
Cue_E2_1A_KateRoom_DontBelieve_Kate_Max_010="If you do that, they won't believe you. You're on video grabbing at all those guys and they'll use that against you. Bad."
Cue_E2_1A_KateRoom_DontBelieve_Kate_Max_030="That's what you have to prove. Not them. I'm just telling you how the cops and school will look at this. The video doesn't exactly back you up..."
Cue_E2_1A_KateRoom_DontBelieve_Kate_Max_050="No, no, Kate. I just don't want you to get hurt any more..."
Cue_E2_1A_KateRoom_DontBelieve_Kate_Max_070="I think we should wait. There are other things going on that might help you."
Cue_E2_1A_KateRoom_KateBook_Kate_010="So Max, can I ask you a question? And please be honest."
Cue_E2_1A_KateRoom_KateBook_Kate_030="I need to find out if Nathan Prescott helped me... or hurt me after that party."
Cue_E2_1A_KateRoom_KateBook_Kate_050="Should I go to the police?"
Cue_E2_1A_KateRoom_KateBook_Max_020="Absolutely, Kate. Anything."
Cue_E2_1A_KateRoom_KateBook_Stella_010="Turn the goddamn music down! People sleeping!"
Cue_E2_1A_KateRoom_KateBook_Stella_020="Go away! People sleeping!"
Cue_E2_1A_MaxRoom_FindRoomSacked_Max_010="No fucking way!"
Cue_E2_1A_MaxRoom_FindRoomSacked_Max_020="This is not why I came to Blackwell. And I still have to clean all this crap up?"
Cue_E2_1A_MaxRoom_FindRoomSacked_Max_030="After I find Kate's book..."
